Revit.Elements.Viewport.#ctor(Revit.Elements.Views.Sheet,Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point)
Create a new Viewport by Sheet, View and Location
sheet:
view:
location:

Revit.Elements.Viewport.InitViewport(Revit.Elements.Views.Sheet,Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point)
Initialize a Viewport element
sheet:
view:
location:

Revit.Elements.Viewport.Sheet
Get ViewSheet on which the viewport appears

Revit.Elements.Viewport.View
Get the associated View

Revit.Elements.Viewport.BoxCenter
Returns the center of the outline of the viewport on the sheet, excluding the viewport label.

Revit.Elements.Viewport.SetBoxCenter(Autodesk.DesignScript.Geometry.Point)
Moves this viewport so that the center of the box outline (excluding the viewport label) is at a given point.
point:

Revit.Elements.Viewport.BoxOutline
Returns the outline of the viewport on the sheet, excluding the viewport label.

Revit.Elements.Viewport.LabelOutline
Gets the outline viewport's label on the sheet.

Revit.Elements.Viewport.LabelOffset
The offset is a two-dimensional vector from left bottom corner of the viewport
with Rotation set to None to the left end of the viewport label line. The Z coordinate
is ignored.

Revit.Elements.Viewport.SetLabelOffset(Autodesk.DesignScript.Geometry.Point)
Set LabelOffset of Viewport
point:
Returns:

Revit.Elements.Viewport.LabelLineLength
The length of the viewport label line in sheet space, measured in feet.

Revit.Elements.Viewport.SetLabelLineLength(System.Double)
Set LabelLineLength of Viewport
length:
Returns: